[ 
    {
      "title": "Lighthouse Point Gardens",
      "price": 145,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20190716012535522845000000-o.jpg",
      "description": "SEASONAL $1450 MONTHLY. LOCATION! LOCATION! EXCLUSIVE LIGHTHOUSE POINT COMMUNITY. LOCATED IN THE CENTER OF ACTIVITY, YET MINUTES TO THE BEAUTIFUL DEERFIELD BEACH. WALKING DISTANCE TO PUBLIX, SHOPPING CENTERS, SPECIALTY SHOPS AND DINING. SIDEWALKS FOR STROLLING THROUGH BEAUTIFUL RESIDENTIAL AREA, PARK & TENNIS CENTER. LOVELY SAFE AREA. UNIT IS TASTEFULLY FURNISHED. NEUTRAL THROUGHOUT. EXTRA HALF BATH. NICE KITCHEN. GENEROUS LIVING ROOM & ALCOVE DINING. ALL GENTLY USED & IMMACULATELY MAINTAINED. BEAUTIFUL SEASONAL RENTAL. SHUFFLE BOARD. WELL KEPT COMMUNITY.",
      "address": "2050 NE 39th Street #313S",
      "latitude": 26.278963,
      "longitude": -80.095615,
      "city": "Lighthouse Point",
      "state": "FL"
    },
    {
      "title": "THE AVENTURA BEACH CLUB C",
      "price": 150,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20190918232139104882000000-o.jpg",
      "description": "*** BEAUTIFUL DIRECT OCEAN VIEWS IN OCEANFRONT BUILDING **** CORNER RENOVATED STUDIO *** FULLY FURNISHED - FULL KITCHEN APPLIANCES *** CABLE AND WI-FI INCLUDED *** KING BED AND SOFA BED *** DIRECT ACCESS TO THE BEACH - ALL RESORT AMENITIES *** TIKI BAR - POOL -GYM - RESTAURANT - COFFEE SHOP - CONVENIENCE STORE - VALET - BEACH SERVICE *** SHORT OR LONG TERM MINIMUM 10 DAYS *** HIGH SEASON: U$2000 ----- LOW SEASON U$ 1500 --------- ***",
      "address": "19201 Collins Avenue #744",
      "latitude": 25.954444,
      "longitude": -80.1197,
      "city": "Sunny Isles Beach",
      "state": "FL"
    },
    {
      "title": "THE AVENTURA BEACH CLUB C",
      "price": 150,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210427174754425120000000-o.jpg",
      "description": "Studio on the beach in Aventura Beach Club, Sunny Isles Beach. Two queen beds, kitchenette. Cable, Internet, Wi-Fi, electricity are included in the rent. No balcony. Great location. Close to shopping, restaurants and entertainment. Call for availability.",
      "address": "19201 Collins Avenue #723",
      "latitude": 25.954444,
      "longitude": -80.1197,
      "city": "Sunny Isles Beach",
      "state": "FL"
    },
    {
      "title": "COASTAL WATERWAYS CO-OP",
      "price": 170,
      "bedrooms": 1,
      "bathrooms": 2,
      "beds": 1,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20201229020859357368000000-o.jpg",
      "description": "Available only from July 1st, 2021 for a maximum of 6 months. Absolutely gorgeous impeccable remodeled unit. Your dream vacation rental! Top floor completely renovated, brand new, cozy apartment comes fully furnished and equipped for seasonal rental! Large bedroom with ample closet space and 2 full bathrooms. Breathtaking views of the Intracoastal waterways from a screened porch. Coastal Waterways coop is an all-ages very quiet and serene building, a hidden oasis in the heart of the City of Hallandale. It's located within walking distance to the beach, shops, and restaurants. Located adjacent to the brand new Beach Walk Hotel on the Intracoastal side. Close to both Fort Lauderdale and Miami Airports, Gulfstream Casino and A Aventura Mall. Spend your vacation days in paradise!",
      "address": "2600 Diana Drive #320",
      "latitude": 25.985358,
      "longitude": -80.122875,
      "city": "Hallandale Beach",
      "state": "FL"
    },
    {
      "title": "LA PERLA CONDO",
      "price": 450,
      "bedrooms": 3,
      "bathrooms": 2,
      "beds": 3,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20200416093142587199000000-o.jpg",
      "description": "******AVAILABLE 6 MONTHS + 1 DAY OR YEARLY****** NOW FULLY FURNISHED. 2 BEDROOMS PLUS A DEN. 1 ASSIGNED SELF PARKING 1 VALET SPOT INCLUDED. AVAILABLE 6 MONTH 1 DAY OR ANNUALLY. CALL FOR AVAILABILITY AND SEASONAL PRICING. INCREDIBLE OCEAN AND PANORAMIC CITY VIEWS FROM 36TH FLOOR. BEST SUNRISE AND SUNSET VIEWS IN ALL OF SUNNY ISLES FROM EACH BEDROOM AND THE UNIT'S 3 BALCONIES. UNIT COMES WITH 1 ASSIGNED VALET. PARKING THE NEWLY RENOVATED HISTORIC PIER AND RESTAURANT AND IS WITHIN WALKING DISTANCE TO ALL THE STORES, RESTAURANTS AND SHOPPING PLAZAS IN SUNNY ISLES. BUILDING HAS STATE OF THE ART FITNESS ROOM, CONCIERGE, KIDS PLAYROOM, BILLIARD ROOM, AND PARTY ROOM.",
      "address": "16699 Collins Avenue #3601",
      "latitude": 25.930199,
      "longitude": -80.121209,
      "city": "Sunny Isles Beach",
      "state": "FL"
    },
    {
      "title": "Plaza 15 Condo",
      "price": 155,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20200428213836770073000000-o.jpg",
      "description": "Nicely updated 1 bedroom 1 bath in East Fort Lauderdale. Has updated kitchen and bathroom. Tile Floors, Washer/Dryer. Comes completely furnished with everything. Cable & Internet and Electric included in the rent. Building is conveniently minutes from the beach, shopping, bars and restaurants, Las Olas and Downtown. Also conveniently located to all major highways, airports as well as the hardrock casino. Call with any questions on this great unit.",
      "address": "1600 SE 15th Street #407",
      "latitude": 26.103046,
      "longitude": -80.125216,
      "city": "Fort Lauderdale",
      "state": "FL"
    },
    {
      "title": "Deauville Terrace Co-Op",
      "price": 200,
      "bedrooms": 2,
      "bathrooms": 2,
      "beds": 2,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210426142926241475000000-o.jpg",
      "description": "Are you ready to get away from it all in this Vacation Rental? Minimum 1 months desired - Maximum 6 months - available for 2021 season. Be in Paradise before the frigid winter months are upon you. This 2 BR 2 BA Corner Unit has an over-sized screened patio, close to the pool, shuffle board and BBQ and a parking spot right outside your door. Deauville Terrace is located in a secluded quite cul-de-sac location in Harbor Village a sought after community east of Federal Highway between the 14th Street Causeway and Atlantic Blvd. Lots of Shopping, Restaurants, Golfing, Biking and more. Close to beaches, Pompano Mall and all great sites Pompano Beach has to offer. Also available for sale asking $165,000 One person must be 55+",
      "address": "2541 NE 11th Street #117",
      "latitude": 26.24514,
      "longitude": -80.098269,
      "city": "Pompano Beach",
      "state": "FL"
    },
    {
      "title": "MERIDIAN COURT CONDO",
      "price": 140,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20200522153056753000000000-o.jpg",
      "description": "Completely furnished!! Ready to move, in the heart of south beach, first floor completely redone , washer & dryer inside the apartment. Water is included. Asking only 2 months in advance. Hurry bring your clients!!!For rents less than 1 year send me a text message.",
      "address": "911 Meridian Avenue #105",
      "latitude": 25.779622,
      "longitude": -80.135901,
      "city": "Miami Beach",
      "state": "FL"
    },
    {
      "title": "LAUDERDALE",
      "price": 99,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Apartment",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20200610030838276406000000-o.jpg",
      "description": "BEAUTIFUL UPDATED 300 SQ.FT. STUDIO $990 INCLUDES UTILITIES,UNFURNISHED WITH PRIVATE ENTRANCE AND LAUNDRY ACCESS. GREAT LOCATION! YOU MUST SEE IT! IT CAN BE RENTED FURNISHED FOR $1040 OR . KEYLESS LOCKS. PET FRIENDLY. PLEASE ASK US ABOUT OUR OTHER BEAUTIFUL RENTALS FROM OUR EXTENSIVE PORTFOLIO. 1 BED /1 BATH AVAILABLE FOR $1175 FURNISHED NO UTILITIES INCLUDED.",
      "address": "2101 SE 4th Avenue #1502",
      "latitude": 26.095405,
      "longitude": -80.138968,
      "city": "Fort Lauderdale",
      "state": "FL"
    },
    {
      "title": "OAKLAND PARK SECOND ADD",
      "price": 160,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Apartment",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20200619211833648172000000-o.jpg",
      "description": "1 BEDROOM 1 BATH 600 SQ.FT BEAUTIFUL APARTMENT WITH PRIVATE ENTRANCE IN GORGEOUS PROPERTY IN THE HEART OF OAKLAND PARK! LAUNDRY IN UNIT, KEYLESS LOCKS, CENTRAL A/C AND MINI SPLIT A/C (NOT WINDOW UNIT - SUPER QUIET). SOPHISTICATED KITCHEN! OUTDOOR COVERED BALCONY/PATIO AREA WITH SEATING AND CHIC AMBIENCE. REMODELED IN 2019. YOU MUST SEE IT! IT CAN BE RENTED FURNISHED OR UNFURNISHED. PET FRIENDLY. PLEASE ASK US ABOUT OUR OTHER BEAUTIFUL RENTALS FROM OUR EXTENSIVE PORTFOLIO.",
      "address": "1531 NE 35th Street #1211",
      "latitude": 26.171722,
      "longitude": -80.127823,
      "city": "Oakland Park",
      "state": "FL"
    },
    {
      "title": "CORAL RIDGE ISLES",
      "price": 120,
      "bedrooms": 0,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Apartment",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20200707110109533460000000-o.jpg",
      "description": "BEAUTIFUL 400 SQ.FT. STUDIO WITH PRIVATE ENTRANCE IN GORGEOUS PROPERTY. EXCELLENT NEIGHBORHOOD! HEATED POOL, IMPACT SHUTTERS, KEYLESS LOCKS, COMPLETELY REMODELED! SUPER HIGH-END KITCHENNETTE, GORGEOUS BATHROOM. BEAUTIFUL GAZEBO WITH HANGING LIGHTS. PROPERTY FEATURES EXTERIOR LIGHTING AND MINI SPLIT A/C (NOT WINDOW UNIT - SUPER QUIET). DON'T MISS OUT ON THIS BEAUTIFUL CORAL RIDGE ISLES HOME! IT CAN BE RENTED FURNISHED OR UNFURNISHED. PET FRIENDLY. SHARED POOL. YARD AND POOL MAINTENANCE INCLUDED IN RENT. PLEASE ASK US ABOUT OUR OTHER BEAUTIFUL RENTALS FROM OUR EXTENSIVE PORTFOLIO.",
      "address": "1740 NE 49th Street #1101",
      "latitude": 26.187804,
      "longitude": -80.123685,
      "city": "Fort Lauderdale",
      "state": "FL"
    },
    {
      "title": "palm beach point",
      "price": 750,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Cottage",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20200625204208072884000000-o.jpg",
      "description": "9 to 12 large matted stalls (12x12) available, conveniently located for optional hacking distance to both WEF and the Ridge horse shows. Set on 5 acres with a private, cul-de-sac location in the exclusive gated community of Palm Beach Point. This first class equestrian facility includes a riding arena suitable for dressage or jumping, and 6 grass paddocks. The barn is equipped with fly system, security cameras. Air-conditioned tack room w/ bathroom, washer dryer and mini kitchen. Apartment availAdditional apartment for barn manager or groom housing available for additional cost. Apartment features kitchen and private bathroom overlooking views of grassy paddocks. Individual stall watering, individual fan system per stall, and individual fly system. Matted wash rack with cold and hot water.",
      "address": "4491 Palm Breeze Trail",
      "latitude": 26.616291,
      "longitude": -80.293194,
      "city": "Wellington",
      "state": "FL"
    },
    {
      "title": "OCEAN POINT DOUBLE TREE",
      "price": 440,
      "bedrooms": 2,
      "bathrooms": 2,
      "beds": 2,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210327025542719001000000-o.jpg",
      "description": "Breathtaking direct Ocean Views from every room. Stunning two bed, two & half bath unit. Great split floor plan, tile floors on every room, unit comes fully decorated and furnished & included Washer and Drier. On Hotel program, can be used as a private home or hotel. Excellent for corporate use. Condo fee included electricity, cable, water, A/C maintenance. Building offers concierge service, piano bar, business center, gym/spa, pool & Jacuzzi, beach service, restaurant and beach bar. Best price per sqf. in Sunny Isles",
      "address": "17375 Collins Avenue #2603",
      "latitude": 25.93701,
      "longitude": -80.120603,
      "city": "Sunny Isles Beach",
      "state": "FL"
    },
    {
      "title": "TREE TOP SUB",
      "price": 175,
      "bedrooms": 2,
      "bathrooms": 1,
      "beds": 2,
      "placeType": "Apartment",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210427161337912270000000-o.jpg",
      "description": "Pet fee $150 per monthUtilities not included for annual rent annual price unfurnished $1450",
      "address": "8520 SW 107th Avenue #2-B1",
      "latitude": 25.689547,
      "longitude": -80.368122,
      "city": "Miami",
      "state": "FL"
    },
    {
      "title": "Wimbledon Tennis Lodges",
      "price": 300,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Apartment",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20200714152438019510000000-o.jpg",
      "description": "Available for short term rental for 1 month or more!! STARTING APRIL 2021  Equestrians delight, gorgeous studio recently renovated by high end interior designer.  Perfectly situated in the prestigious community of Palm Beach Polo & Country Club. Conveniently located near all top international equestrian activities, shopping and twenty minutes from Palm Beach. One bedroom and one bathroom. A private patio that extends the length of the unit and offers a tranquil retreat over looking a stunning pond and fountain. Fully furnished with 1 Queen bed, additional day bed, can sleep up to four people. Unit is equipped with washer/dryer, walk-in closet, all linens and kitchen including all dinnerware and utensils. Includes heated pool and Jacuzzi.",
      "address": "11863 Wimbledon Circle #519",
      "latitude": 26.65083,
      "longitude": -80.222611,
      "city": "Wellington",
      "state": "FL"
    },
    {
      "title": "ELLESMERE B CONDO",
      "price": 190,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20200717161536801595000000-o.jpg",
      "description": "Fully furnished winter seasonal rental available, minimum rental term is 4 months. Lovely 1 BR 1.5 Baths. Enclosed patio overlooking serene garden views. Walking distance to club house, near beaches, entertainment, great unit to keep warm in winter. Enjoy club house with theater, tennis, pool, social activities, classes, exercise, indoor and outdoor pools, and more.",
      "address": "3026 Ellesmere B #3026",
      "latitude": 26.317173,
      "longitude": -80.140681,
      "city": "Deerfield Beach",
      "state": "FL"
    },
    {
      "title": "THE DECOPLAGE CONDO",
      "price": 150,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210421203826927897000000-o.jpg",
      "description": "STUDIO AT FAMOUS DECOPLAGE BUILDING WITHIN WALKING DISTANCE TO THE MOST TRENDY RESTAURANTS AND PLACES IN SOBE. WHERE LINCOLN RD MEETS THE OCEAN, ACROSS FROM THE RITZ CARLTON AND NEXT TO THE LOWES HOTEL. RENOVATED HEATED POOL AND NEW GYM FULLY FURNISHED UNIT WATER, SEWER, CABLE, WIFI AND VALET PARKING SPACE INCLUDED IN THE RENT * Rent price may vary for short term rentals (less than 6 months) and winter season (NOVEMBER - APRIL)* Move out cleaning fee will be paid upfront*",
      "address": "100 Lincoln Road #731",
      "latitude": 25.790359,
      "longitude": -80.128977,
      "city": "Miami Beach",
      "state": "FL"
    },
    {
      "title": "EDGE CONDO",
      "price": 160,
      "bedrooms": 0,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20200729214359509728000000-o.jpg",
      "description": "AVAILABLE AS OF AUGUST thru DEC 2021.  Imagine living in a high-rise condo with fabulous views! Also imagine being minutes from the beach, shopping and dining.  This large 1 bedroom studio is beautifully furnished and fully turnkey with 10' ceilings that give the feeling of real spaciousness.  Lots of natural light!  Located on the 12th floor of The Edge Condo building, It overlooks the pool area, the city of West Palm Beach and Clear Lake.  You can lease for a min of 3 months.  1 pet allowed <20 lbs with pet fee.  The building provides concierge service and security, a pool with spa, well equipped fitness center and large clubhouse.  Extremely close the The Kravis Center of the Performing Arts and City Place, where you can enjoy excellent shopping and gourmet dining.",
      "address": "300 S Australian Avenue #1215",
      "latitude": 26.711496,
      "longitude": -80.064022,
      "city": "West Palm Beach",
      "state": "FL"
    },
    {
      "title": "Century Village East",
      "price": 190,
      "bedrooms": 2,
      "bathrooms": 1,
      "beds": 2,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210116022759355395000000-o.jpg",
      "description": "SEASONAL min. 4 mos. - 2nd Floor CORNER! Lift in Building. Must see this lovely unit with half bath and beautiful newer kitchen. Tiled. Walk-in shower in main bath. Queen-size bed in master bedroom and Murphy bed in second bedroom. Lovely living room has a very large flat screen T.V. Also, there is one in the bedroom. There are also 2 bikes for your use. The condo also has a wine cooler. This is the perfect place to be. Century Village has all the amenities one could hope for....1,700 seat theater, fitness center. 17 pools (one is indoor), tennis, courtesy shuttle, game and card rooms, pickle ball, & 20 billiard tables. Old Florida Caf\u001a is next to clubhouse and we are 3.3 miles to the beach & fishing pier. Owners will consider seasonal rental min. 3 mos. at $2,200/mo. for up to 6 months.",
      "address": "149 Markham G",
      "latitude": 26.309598,
      "longitude": -80.141309,
      "city": "Deerfield Beach",
      "state": "FL"
    },
    {
      "title": "BOCA TEECA CONDO 2",
      "price": 180,
      "bedrooms": 2,
      "bathrooms": 2,
      "beds": 2,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20200825200805865435000000-o.jpg",
      "description": "First floor,very clean corner garden apt with new master bath and new  impact windows. Screened porch.Community has pool,laundry facilities...close to shopping and beaches",
      "address": "5501 NW 2nd Avenue #1140",
      "latitude": 26.398614,
      "longitude": -80.084189,
      "city": "Boca Raton",
      "state": "FL"
    },
    {
      "title": "SADDLE TRAIL PARK OF WELLINGTON",
      "price": 400,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Cottage",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20200903221134312209000000-o.jpg",
      "description": "It's all about location! Price shown is per stall for the season. Up to 4 stalls available within hacking distance from WEF.  Please note that tenant needs to provide fans and mats for each stall if needed. There is a tack room (no air conditioning) and a feed room. Plastic dumpsters for manure removal are suggested. Full board also available.",
      "address": "14539 Belmont Trace #(Barn)",
      "latitude": 26.646824,
      "longitude": -80.279108,
      "city": "Wellington",
      "state": "FL"
    },
    {
      "title": "Century Village Deerfield",
      "price": 200,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20200908233547214580000000-o.jpg",
      "description": "Lovely first floor unit in a great location that is close to the pool & spectacularly renovated Clubhouse. Beautiful laminate and tiled flooring. Come see this cozy unit ready for you! Bring your suitcase and your smiles and get ready to live the fabulous Century Village lifestyle in sunny Deerfield Beach!",
      "address": "275 Durham H",
      "latitude": 26.317007,
      "longitude": -80.135923,
      "city": "Deerfield Beach",
      "state": "FL"
    },
    {
      "title": "LOXAHATCHEE GROVES",
      "price": 100,
      "bedrooms": 0,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Cottage",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20200911135327264391000000-o.jpg",
      "description": "**ONLY 6 STALLS LEFT**  ATG Equestrian LLC, is welcoming an annual or seasonal Tenant for the 2020-2021 season. 10 Stalls Available with 24 hr video surveillance in each stall. Tenant will share use of the 8 lush paddocks, extra large Feed room, and A/c tack room. The farm boasts 2 large sand rings (ring 1 is 80' x 120') & (ring 2 is 220' x150'), RV hook-ups, fly spray system, and a ton of vehicle, and trailer parking. You and Your horses will love to call this home! Full/Partial, care/training also available.",
      "address": "2650 A Road",
      "latitude": 26.716453,
      "longitude": -80.295032,
      "city": "Loxahatchee Groves",
      "state": "FL"
    },
    {
      "title": "TILFORD C CONDO",
      "price": 170,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20200915151033124210000000-o.jpg",
      "description": "Seasonal Rental.Come relax in your home away from home. Enjoy a rejuvenating nights sleep on the queen size bed.  Remote control shades on the lovely furnished patio. The front room also has a let out sofa.  Great water view just steps away from your door. Watch your favorite tv shows on either of the large screen tvs. Enjoy romantic chats while preparing meals in the open kitchen. Available and waiting to host you for your winter get away.",
      "address": "59 Tilford C #59",
      "latitude": 26.311735,
      "longitude": -80.143822,
      "city": "Deerfield Beach",
      "state": "FL"
    },
    {
      "title": "SEA RISE CONDO",
      "price": 195,
      "bedrooms": 2,
      "bathrooms": 2,
      "beds": 2,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20200929045815172404000000-o.jpg",
      "description": "Enjoy the Jupiter Beach Lifestyle only short walk to the sand.  Very well kept spacious 2 bed/2 bath comes fully furnished.  Lots of natural light with garden views. Just bring your suitcases and relax!  Zeke's Golf Cart Service will pick you up and bring you to local restaurants, attractions, even Publix!  Enjoy long walks along the beach, or use the bike lanes and exercise by the Ocean.  Plenty to do or do nothing at all in this ideal location.   TDT # 000014372 -   BTR # 2019115261",
      "address": "1605 S Us Highway 1 #E306",
      "latitude": 26.920389,
      "longitude": -80.072894,
      "city": "Jupiter",
      "state": "FL"
    },
    {
      "title": "TIFFANY APTS CO-OP",
      "price": 180,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20200928171726019105000000-o.jpg",
      "description": "3 month minimum term up to 6 months (3) month rental $5400; (1) month refundable Deposit $1800; Application Fee ($100) Cleaning Fee ($100)",
      "address": "1504 S Surf Road #43",
      "latitude": 26.002827,
      "longitude": -80.116829,
      "city": "Hollywood",
      "state": "FL"
    },
    {
      "title": "STRATHMORE GATE I UNIT TWO",
      "price": 180,
      "bedrooms": 2,
      "bathrooms": 1,
      "beds": 2,
      "placeType": "Villa",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20200929172029859405000000-o.jpg",
      "description": "55+ community                     2 bedroom one bath in quiet Strathmore Gate  New appliances, turn key .No pick up trucks, one dog or cat allowed, not over 20 lbs, and must have vet cert for weight and DNA. , Pet deposit to HOA $100., application fee is$135 per person , or $150 for two people.$1800 for 4 month Rental. $2400 for a 3 month rental.",
      "address": "148 Karanda Court",
      "latitude": 26.702312,
      "longitude": -80.23197,
      "city": "Royal Palm Beach",
      "state": "FL"
    },
    {
      "title": "LUCERNE LAKES GOLF COLONY CONDOS 1 THRU 12 AND 14 A",
      "price": 180,
      "bedrooms": 2,
      "bathrooms": 2,
      "beds": 2,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20200929211905366478000000-o.jpg",
      "description": "THIS  COZY  AND AFFORDABLE CONDO IS A GREAT GETAWAY TO PROLONG YOUR VACATION IN A PERFECT ACTIVE COMMUNITY WITH A CLUB HOUSE TWO POOLS ,HOT TUB,SHUFFLE BOARS,POOL TABLE,PING PONG CLOSE TO EVERYTHING WITH A GREAT VIEW OF GOLF COURSE & COMPLETELY FURNISHED, CONDO IS READY WITH WI-FI & CABLE INCLUDED. . JUST BRING YOUR CLOTHS !!",
      "address": "7142 Golf Colony Court #202",
      "latitude": 26.608374,
      "longitude": -80.157076,
      "city": "Lake Worth",
      "state": "FL"
    },
    {
      "title": "MARCO POLO BEACH RESORT",
      "price": 140,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20201118120750518461000000-o.jpg",
      "description": "Beautiful studio,beach and ocean access. Corner unit with partial ocean view. Furniture includes a kitchenette, refrigerator, microwave,built-in cabinets, TV, queen bed, sofa bed, dining table with chairs, blinds, and some linen.Aventura Beach a.k.a Marco Polo Condominium is a well-known complex with an unbeatable location at Collins Ave, where many luxury buildings are settled. This unit has unrestricted access to the beach and the ocean.Besides the private pool, gym, cabana, restaurants, tiki bar, and many more amenities to enjoy, the Rent includes almost everything(water, electricity, hot water, laundry facilities, basic cable, and basic internet).**Soooo... hurry...Are you ready to spend your spare time o short stay at the beach?? Call us for more details!!**",
      "address": "19201 NE Collins Avenue #726",
      "latitude": 25.954442,
      "longitude": -80.119619,
      "city": "Sunny Isles Beach",
      "state": "FL"
    },
    {
      "title": "Coral Ridge East Condo",
      "price": 120,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20201009031940479991000000-o.jpg",
      "description": "A LARGE 1BEDROOM / 1 & 1/2BATHROOM EAST OF U.S.1 EASY TO SHOW BRING AN OFFER.",
      "address": "4501 NE 21st Avenue #203",
      "latitude": 26.18417,
      "longitude": -80.117242,
      "city": "Fort Lauderdale",
      "state": "FL"
    },
    {
      "title": "New York Apts Condo",
      "price": 190,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20201016002030876641000000-o.jpg",
      "description": "Bright, large 1bed,1bath east facing condo unit with spectacular views of the pools and intracoastal inlet. A 5 min drive to Deerfield beach. Minutes to grocery stores, pharmacies, target, Walmart, restaurants and cafes. Unit is located on the second floor of a 2 story building with a total of 12 units. Smoking is allowed on building property and on balcony BUT not in unit. 1 reserved parking spot and plenty of visitors parking. This building has access to 2 heated pools, putting green, shuffleboard, BBQ at poolside. Has a filtered water system under kitchen faucet and on fridge door, Keurig coffee maker, microwave, toaster, washer and dryer in unit, beach chairs, umbrellas and towels. 2 smart TVs with cable and internet included. Queen size bed and pull out sofa both with new memory foam",
      "address": "1445 SE 15th #202",
      "latitude": 26.297676,
      "longitude": -80.082672,
      "city": "Deerfield Beach",
      "state": "FL"
    },
    {
      "title": "Kings Point Flanders A G",
      "price": 180,
      "bedrooms": 2,
      "bathrooms": 2,
      "beds": 2,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20201019031240645180000000-o.jpg",
      "description": "Enjoy resort-style living. First-floor apartment that has been updated with newer tiles except for Master Bedroom which has carpet. The kitchen has a newer fan, stainless steel appliances include a builtin microwave & cabinets. The Master Bedroom has a walk-in closet with some custom shelves. The second bedroom has a glass slider door tp the patio & utility room where there is a standard washer & dryer with extra shelves. Furnished as of 1/20. Walking distance to pool, golf & course & Flanders Clubhouse. Main Clubhouse has live shows during Winter season which includes a workshop, library, fitness center, movies, indoor & outdoor pools, tennis courts & so much more. Approximately 15 to Downtown Delray & Beaches. Close to major shopping centers and major highways. Courtesy bs on site.",
      "address": "686 Flanders O #686",
      "latitude": 26.440355,
      "longitude": -80.143532,
      "city": "Delray Beach",
      "state": "FL"
    },
    {
      "title": "REGAL PALMS MAYFAIR CONDO",
      "price": 180,
      "bedrooms": 2,
      "bathrooms": 2,
      "beds": 2,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20201023005038584249000000-o.jpg",
      "description": "Beautiful 2 bed 2 bath 3rd floor corner unit fully furnished with modern furniture, plenty of sun light with spacious balcony, a must see unit.",
      "address": "3300 Springdale Boulevard #301",
      "latitude": 26.647355,
      "longitude": -80.101902,
      "city": "Palm Springs",
      "state": "FL"
    },
    {
      "title": "LUCERNE LAKES GOLF COLONY",
      "price": 120,
      "bedrooms": 2,
      "bathrooms": 2,
      "beds": 2,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20201024014847927270000000-o.jpg",
      "description": "LOCATION IS THE KEY! THIS 55+ UNIT ON THE 1ST FLOOR HAS A BEAUTIFUL VIEW OF THE GOLF COURSE FROM THE SCREENED PORCH. ALL TILE AND TASTEFULLY DECORATED! THE MASTER BEDROOM HAS WALK IN CLOSET AND MASTER BATH HAS WALK IN SHOWER. IT CAN BE RENTED YEARLY FOR $1200 MONTHLY (TENANT WILL PAY ELECTRIC) OR SEASONAL FOR $1800 ALL INCLUSIVE. READY TO MOVE IN. UNIT MUST BE RENTED FURNISHED ONLY. ALREADY RENTED. AVAILABLE AGAIN fEB. 22, 2021",
      "address": "7209 Golf Colony Court #105",
      "latitude": 26.607848,
      "longitude": -80.159463,
      "city": "Lake Worth",
      "state": "FL"
    },
    {
      "title": "HIGH POINT OF DELRAY SEC 6 CONDO",
      "price": 160,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Villa",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20201024152433762400000000-o.jpg",
      "description": "Enjoy the Florida lifestyle in this charming seasonal 1 bedroom 1 1/2 half bath villa located in the much desired neighborhood of High Point of Delray! Turnkey furnished villa with a lovely back yard with plenty of green space where you can BBQ and sit back and relax while enjoying the lovely weather! Florida living at its best in this very active 55+ community where you'll find many planned social activities, resort style pool, clubhouse, tennis court, shuffle board, and so much more! This gem is located in the heart of Delray-close to Atlantic Avenues famous restaurants and beaches. Water and basic cable are included. Seasonal from December-April and now also available off season for the summer! (If need sooner or different dates, owner may be able to accommodate). No HOA approval req!",
      "address": "1332 High Point Place #C",
      "latitude": 26.466238,
      "longitude": -80.11235,
      "city": "Delray Beach",
      "state": "FL"
    },
    {
      "title": "GARDEN ISLES CO-OP 2",
      "price": 195,
      "bedrooms": 2,
      "bathrooms": 2,
      "beds": 2,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20201124222535618742000000-o.jpg",
      "description": "PRIME LOCATION- 2 MILES TO THE BEACH!! BEAUTIFULLY DECORATED 2 BEDROOM, 2 BATH PIED-�-TERRE,   SPACIOUS SCREENED PORCH OVERLOOKING HEATED POOL. DECORATOR PAINT, CERAMIC TILE THROUGHOUT, NEWER FURNITURE,  KITCHEN W/ GRANITE COUNTERS AND G.E APPLIANCES, CENTRAL A/C. . PERFECT WINTER GETAWAY!**Tenant pays cable & electric***",
      "address": "651 Pine Drive #105",
      "latitude": 26.230179,
      "longitude": -80.116435,
      "city": "Pompano Beach",
      "state": "FL"
    },
    {
      "title": "WYNMOOR-BIMINI VILLAGE",
      "price": 180,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20201102120847256099000000-o.jpg",
      "description": "AVALIABLE SEASONAL, MINIMUN 4 MONTHS, FULLY FURNISHED, 1 BEDROOM.1/5 BATHROOM,TILE FLOOR THROUGH OUT, WASHING AND DRYER INSIDE THE UNIT, ENCLOSED PATIO. WYNMOOR COUNTRY CLUB WITH ALL ITS FABULOUS AMENITIES, POOLS, GOLF, TENNIS,PICKLEBALL, BBQ AREA, RESTAURANT, MOVIE THEATER, FITNESS CENTER, CLUB HOUSE, GATED COMMUNITY, 24 HOURS SECURITY, TRANSPORTATION INSIDE AND OUTSIDE COMPLEX, CLOSE TO AL MAJOR ROADS. ABSOLUTELY MOVE-IN- CONDITION. NO SMOKERS, NOT PETS. ASSO REQUIRE 1 OCCUPANT 55+.DETAILS/COMMENTS POSTED IN THIS LISTING ARE NOT GUARANTEED.",
      "address": "3405 Bimini Lane #J4",
      "latitude": 26.251827,
      "longitude": -80.173237,
      "city": "Coconut Creek",
      "state": "FL"
    },
    {
      "title": "Chateau De Ville Condo",
      "price": 175,
      "bedrooms": 2,
      "bathrooms": 2,
      "beds": 2,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210422041827171700000000-o.jpg",
      "description": "Wonderful opportunity to rent east of Dania, close to beach. Renovated, furnitured condo in beautiful community.Can be rented minimum of 6 months at $2,000.00 a month. Master Bed is queen size and second bedroom twin. Wonderful view of garden from Balcony. Washer and Dryer inside the unit. 2 Parking spaces!Easy to show!",
      "address": "430 SE 7th Street #202-E",
      "latitude": 26.040158,
      "longitude": -80.136557,
      "city": "Dania Beach",
      "state": "FL"
    },
    {
      "title": "DEERFIELD BEACH",
      "price": 150,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Apartment",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210414183816412631000000-o.jpg",
      "description": "Great location one block from the beach.  1 bed and 1 bath.  Tiled througout.  2nd floor with balcony overlooking the pool.   Small apartment complex with only 8 apts and a private pool and BBQ.  No laundry in the apt or onsite.  Parking for 1 car only.  No pets permitted.  Online Rentspree Application Fee is $30. First, last and 1 month security required for move in with good credit and proof of income and/or assets.  Available unfurnished annual from early to mid May.  Water included.  Tenant pays electric and cable/WiFi.",
      "address": "2031 SE 5th Street #7",
      "latitude": 26.31033,
      "longitude": -80.077074,
      "city": "Deerfield Beach",
      "state": "FL"
    },
    {
      "title": "Oriole Golf & Tennis Club",
      "price": 120,
      "bedrooms": 2,
      "bathrooms": 2,
      "beds": 2,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20201117022917112055000000-o.jpg",
      "description": "(HOPA COMMUNITY, 55+) PRIVATE FIRST FLOR CORNER WITH GOLF AND WATER VIEWS! FULLY FURNISHED!MUST HAVE A 700 CREDIT SCORE AND $33K VERIFIABLE ANNUAL INCOME. MANY PERKS IN THIS COMMUNITY.LOVELY POOL AND CABANA, EXERCISE FACILITIES, CARD AND GAME ACTIVITIES, LIBRARY, GROUP GATHERINGS.COME AND SEE...EASY TO SHOW...SIX MONTH AVAILABLE......YEARLY PREFERRED.",
      "address": "7807 Golf Circle Drive #112",
      "latitude": 26.244736,
      "longitude": -80.225608,
      "city": "Margate",
      "state": "FL"
    },
    {
      "title": "CENTURY VILLAGE CONDO",
      "price": 120,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20201118150131844246000000-o.jpg",
      "description": "Super clean. Central air. Laminate to bedroom. Queen bed. 2 T.V.s    This unit is being offered as an annual rental or 6-month rental. $1000/month annually with all monies up front or $1200/month for a 6-month rental with all monies up front.",
      "address": "124 Mansfield C",
      "latitude": 26.391209,
      "longitude": -80.174778,
      "city": "Boca Raton",
      "state": "FL"
    },
    {
      "title": "CENTURY VILLAGE",
      "price": 140,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20201125192302590505000000-o.jpg",
      "description": "condo with One bedroom FURNISHED seasonal rental, kitchen -living room -covered screened patio  This active adult independent living community located in Boca Raton offers a unique lifestyle with luxurious recreational facilities at unbelievably very affordable prices. It's located near all types of houses of worship,  dining, shopping and entertainment.  A 125,000 square feet the clubhouse is the center for community activity. It features a grand theater seating 1,250 people. There is an huge list of activities, classes, and clubs (may be subject to change with restrictions)",
      "address": "45 Suffolk B #.",
      "latitude": 26.393027,
      "longitude": -80.184194,
      "city": "Boca Raton",
      "state": "FL"
    },
    {
      "title": "BEACH HOUSE CONDO",
      "price": 180,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20201128221053090477000000-o.jpg",
      "description": "Need to escape the cold? Welcome to Paradise! This 1 Bedroom Condo on 2nd Floor with stairs only access is just across from beach access in Palm Beach Shores! Prefers a 6+ month rental at $1800 a month. Will look at shorter term(2-5 months) for $2000 @month. Great Corner Unit-loads of light! No Pets allowed for tenants per building rules, no elevator. Tenant pays all utilities. Credit, criminal & background checks will be run. Close to just about everything-Surfing, Fishing, Golfing, Restaurants, shopping, marinas & the list goes on! 'The Best Little Town in Florida' is the best kept secret. One car only per unit. All info approximate. Tenant responsible for 13% of Gross rent:Tourism State/County Tax, Exit Cleaning fee & $100 Utilities/month. No washer & dryer in unit or on premises.",
      "address": "108 Bravado Lane #8",
      "latitude": 26.776013,
      "longitude": -80.033841,
      "city": "Palm Beach Shores",
      "state": "FL"
    },
    {
      "title": "CATANIA CONDO",
      "price": 200,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20201211042108349728000000-o.jpg",
      "description": "OCEANFRONT LIFESTYLE!!! This well appointed Unit located on recently and completely renovated luxury building features one spacious bedroom with lots of closets and one and a half baths. Come and step into the beautifully and warm waters of Hollywood Beach and enjoy afternoon sunset views from your glass balcony overlooking the boats on the intercoastal waterways. Numerous amenities such as 2 swimming pools, restaurant on site, exercise room, business center, assigned parking, activity room and much more... Available seasonal and may consider yearly as well. Fully furnished for your convenience. MINIMUM 4 MONTH RENTAL ALLOWED - MAX 12 MONTHS",
      "address": "2301 S Ocean Drive #1406",
      "latitude": 25.998061,
      "longitude": -80.11704,
      "city": "Hollywood",
      "state": "FL"
    },
    {
      "title": "PINES OF DELRAY NORTH CONDO",
      "price": 200,
      "bedrooms": 2,
      "bathrooms": 2,
      "beds": 2,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20201221000040196558000000-o.jpg",
      "description": "Don't wait to rent this nicely updated,  lake-view 2nd floor unit for this winter season! Seasonal rental, turnkey apartment has it all. Designer furniture, very clean and ready for your vacation stay. Amenities include 2 clubhouses, tennis, community room and a small gym. Location could not be better! 5 minutes to down town Delray  and a few miles to the beach! Call agent for info. Available for short term $2000/month or annual rent at $1600",
      "address": "1540 NW 18th Avenue #202",
      "latitude": 26.480653,
      "longitude": -80.092571,
      "city": "Delray Beach",
      "state": "FL"
    },
    {
      "title": "360 CONDO A",
      "price": 280,
      "bedrooms": 2,
      "bathrooms": 2,
      "beds": 2,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210421220117174242000000-o.jpg",
      "description": "Fully furnished! Perfect location, amazing view of pool area and Biscayne Bay. 2 beds, 2 baths (fit 6 people) Build in walking closets, fully equipped kitchen, washer-dryer in unit. Impact glass balcony and windows. 1 parking space, plus 24/7/365 free valet service to residents and guests. Gym, pool. 24h security",
      "address": "7900 Harbor Island Drive #1125",
      "latitude": 25.849594,
      "longitude": -80.158611,
      "city": "North Bay Village",
      "state": "FL"
    },
    {
      "title": "ROLEN LAKE GARDENS CO-OP",
      "price": 130,
      "bedrooms": 2,
      "bathrooms": 1,
      "beds": 2,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210421220416828890000000-o.jpg",
      "description": "Rarely available 2 bedroom and 1 bath corner unit on the second floor in this peaceful community. Wood laminate floors in the living area and bedrooms. Tile through the rest. Furnished and move-in ready. Seasonal rental only in 55+ community that offers heated swimming pool, walking path, bocce courts, and more. No pets as per association. Laundry on the 1st floor.",
      "address": "800 SW 11th Avenue #11A",
      "latitude": 25.97529,
      "longitude": -80.164265,
      "city": "Hallandale Beach",
      "state": "FL"
    },
    {
      "title": "Bermuda Village C Condo",
      "price": 135,
      "bedrooms": 2,
      "bathrooms": 2,
      "beds": 2,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20201229041911275969000000-o.jpg",
      "description": "Lake View 2/2 in beautiful Bermuda . This unit is offered for Annual rental or Seasonal Rental and is fully furnished. Masterbedroom has King Size bed with Walk in closet . Guest bedroom has daybed with large closet . Fully tiled through out. Also available for Seasonal rental at $2000.00 per month . Condo is located in a 55+ community",
      "address": "1903 Bermuda Circle ##b4",
      "latitude": 26.251005,
      "longitude": -80.169031,
      "city": "Coconut Creek",
      "state": "FL"
    },
    {
      "title": "THE AVENTURA BEACH CLUB C",
      "price": 200,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20201231001606720198000000-o.jpg",
      "description": "Beautiful Cozy, Fully Furnished Condo on the highly sought after Sunny Isles Beach, Ocean Front (Near North Miami Beach, Florida) is Now Available for Seasonal Rentals 4 - 6 Months Lease Available (Renewable). Perfect Rental Opportunity for Snow Birds, Anyone Transitioning to the area, or for Vacation Destination! Rental Price Includes; Electricity, Water, Cable TV, Wifi, Discounted Valet Service, 24-Hour Security. With Access to; Beach, Large Pool, Kids Pool, Lounge Chairs, Towel Service, Gym, Spa & Sauna, Shopping, Hair Salon, Restaurants, Pizzeria, Art Gallery, Business Center, Ball Room, and much more available onsite!!!!",
      "address": "19201 Collins Avenue #230",
      "latitude": 25.954442,
      "longitude": -80.119619,
      "city": "Sunny Isles Beach",
      "state": "FL"
    },
    {
      "title": "THE AVENTURA BEACH CLUB",
      "price": 200,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20201231001651809919000000-o.jpg",
      "description": "Beautiful Cozy, Fully Furnished Condo on the highly sought after Sunny Isles Beach, Ocean Front (Near North Miami Beach, Florida) is Now Available for Seasonal Rentals 4 - 6 Months Lease Available (Renewable). Perfect Rental Opportunity for Snow Birds, Anyone Transitioning to the area, or for Vacation Destination! Rental Price Includes; Electricity, Water, Cable TV, Wifi, Discounted Valet Service, 24-Hour Security. With Access to; Beach, Large Pool, Kids Pool, Lounge Chairs, Towel Service, Gym, Spa & Sauna, Shopping, Hair Salon, Restaurants, Pizzeria, Art Gallery, Business Center, Ball Room, and much more available onsite!!!!",
      "address": "19201 Collins Avenue #428",
      "latitude": 25.954442,
      "longitude": -80.119619,
      "city": "Sunny Isles Beach",
      "state": "FL"
    },
    {
      "title": "FRENCH LEAVE WEST CONDO",
      "price": 380,
      "bedrooms": 2,
      "bathrooms": 1,
      "beds": 2,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210103221454028725000000-o.jpg",
      "description": "Available May 15 2021-November 15 2021- Live in paradise in this recently renovated, modern oceanfront condo in desirable Lauderdale By the Sea! This fully furnished condo features 2 bedrooms, 1 bath, SS appliances, impact windows, and a huge ocean view terrace. Walking distance to great restaurants, live music, shopping, fishing pier and the beautiful beach. Building features tiki huts, pool, grills, laundry and bike rack. You will love staying here!",
      "address": "4228 N Ocean Drive #37",
      "latitude": 26.186951,
      "longitude": -80.09654,
      "city": "Lauderdale By The Se",
      "state": "FL"
    },
    {
      "title": "High Point",
      "price": 130,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Villa",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210112023457831571000000-o.jpg",
      "description": "Lovely 1 bedroom condo in the heart of Delray.  Fully furnished and ready for your winter holiday.  Six month maximum lease.  Enjoy a huge living room with enclosed sunroom; dining area, extra-large bedroom, 1.5 baths and a private rear patio.  $100 Fee to register with condo.  Basic cable included, tenant to pay electric,  water, internet and expanded cable if desired.",
      "address": "1297 High Point Way #B",
      "latitude": 26.464487,
      "longitude": -80.112269,
      "city": "Delray Beach",
      "state": "FL"
    },
    {
      "title": "Farnham F Condo",
      "price": 150,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210202182319444078000000-o.jpg",
      "description": "Gated community offering a lifestyle in a secure setting with amazing amenities. Convenient community bus transportation to local malls, Shopping Centers, medical facilities and other places. Professional Theaters. Renovated on-site delicious restaurant. Indoor pool & 15 heated Outdoor swimming pools. Shuffleboard. Enjoy Tennis courses. Fitness center with multiple classes. Picnic areas. Walking and Biking trails. Great clubhouse with gorgeous theater, there is always quality entertainment with shows galore. Many classes for various hobby interests. Professional Upgrade from A to Z. Corner unit with beautiful gardens view. Huge enclosed Balcony-Patio converted in entertaining room. Great location near I-95, Sawgrass Expressway, Boca Raton malls. Around 10 min. from lovely Deerfield Beach.",
      "address": "137 Farnham F #137",
      "latitude": 26.305791,
      "longitude": -80.13111,
      "city": "Deerfield Beach",
      "state": "FL"
    },
    {
      "title": "Farnham F Condo",
      "price": 129,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210124021935722697000000-o.jpg",
      "description": "Gated community offering a lifestyle in a secure setting with amazing amenities. Convenient community bus transportation to local malls, Shopping Centers, medical facilities and other places. Professional Theaters. Renovated on-site delicious restaurant. Indoor pool & 15 heated Outdoor swimming pools. Shuffleboard. Enjoy Tennis courses. Fitness center with multiple classes. Picnic areas. Walking and Biking trails. Great clubhouse with gorgeous theater, there is always quality entertainment with shows galore. Many classes for various hobby interests. Professional Upgrade from A to Z. Corner unit with beautiful gardens view. Huge enclosed Balcony-Patio converted in entertaining room. Great location near I-95, Sawgrass Expressway, Boca Raton malls. Around 3 miles from lovely Deerfield Beach.",
      "address": "137 Farnham F",
      "latitude": 26.305791,
      "longitude": -80.13111,
      "city": "Deerfield Beach",
      "state": "FL"
    },
    {
      "title": "THE DECOPLAGE CONDO",
      "price": 170,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210421225121410735000000-o.jpg",
      "description": "STUDIO WITH BALCONY AT FAMOUS DECOPLAGE BUILDING WITHIN WALKING DISTANCE TO THE MOST TRENDY RESTAURANTS AND PLACES IN SOBE. WHERE LINCOLN RD MEETS THE OCEAN, ACROSS FROM THE RITZ CARLTON AND NEXT TO THE LOWES HOTEL. RENOVATED HEATED POOL AND NEW GYM FULLY FURNISHED UNIT WATER, SEWER, CABLE, WIFI AND VALET PARKING SPACE INCLUDED IN THE RENT * Rent price may vary for short term rentals (less than 6 months) and winter season (NOVEMBER - APRIL)* Move out cleaning fee will be paid upfront*",
      "address": "100 Lincoln Road #303",
      "latitude": 25.790359,
      "longitude": -80.128977,
      "city": "Miami Beach",
      "state": "FL"
    },
    {
      "title": "Century Village Deerfield",
      "price": 175,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210207041750458328000000-o.jpg",
      "description": "Beautiful updated 1/1 on 2nd floor(no lift) INCLUDING !INTERNET! This renovated, clean condo features porcelain floors throughout, updated kitchen with granite counter tops and white appliances (range, refrigerator w/ice maker,microwave, dishwasher), disposal, large hall closet, 2 flat screen tv's, sofa bed in living room,queen bed in master bedroom, enclosed patio and WIFI INCLUDED! Steps to pool, Hillsboro gate and plaza. Available 3-6 .months with 4-6 month rental we can negotiate price.",
      "address": "136 Westbury G #136",
      "latitude": 26.317662,
      "longitude": -80.133949,
      "city": "Deerfield Beach",
      "state": "FL"
    },
    {
      "title": "Loxahatchee Groves",
      "price": 185,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Loft",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210201122509265961000000-o.jpg",
      "description": "Lovely remodeled studio. Open concept floor plan on a quiet farm just a few minute drive to the horseshow. Completely remodeled and upgraded kitchen/cabinets and granite counter tops, brand new bathrooms, freshly painted and new floors installed. Great location! Contact me for more details and moving options.",
      "address": "775 F Road",
      "latitude": 26.688679,
      "longitude": -80.260109,
      "city": "Loxahatchee",
      "state": "FL"
    },
    {
      "title": "Fourth Gulfstream Garden",
      "price": 180,
      "bedrooms": 2,
      "bathrooms": 2,
      "beds": 2,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210203003755962413000000-o.jpg",
      "description": "Completely Turn Key Fully Furnished Everything redone from top to bottom. Brand new kitchen, Brand New Bathrooms, Flooring. The locations is minutes from the beach gulfstream, shopping, restaurants. Centrally located to Miami and Fort Lauderdale. This is a 55+ community. Does have a pool.",
      "address": "410 SE 2nd Street #302",
      "latitude": 25.982713,
      "longitude": -80.143348,
      "city": "Hallandale Beach",
      "state": "FL"
    },
    {
      "title": "SHORE CLUB APTS B & C CONDO",
      "price": 195,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210206155320061587000000-o.jpg",
      "description": "Great building on the Intracoastal waterway near awesome shopping centers and parks, This is an active 55+ community with a social clubhouse, heated salt system pool and bbq grills, Minutes to the beautiful NPB golf and country club, fabulous restaurants, shopping, I-95, and PBIA,",
      "address": "110 Shore Court #111b",
      "latitude": 26.807519,
      "longitude": -80.052857,
      "city": "North Palm Beach",
      "state": "FL"
    },
    {
      "title": "LOXAHATCHEE GROVES",
      "price": 55,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Cottage",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210209212338623956000000-o.jpg",
      "description": "THIS IS A HORSE STALL NOT AN APARTMENT OR ROOM. Very clean property that attracts long-term tenants and we are almost always full year round. Large riding arena with jumps, round pen with GGT footing, 12X12 stalls and 2 stalls are 16X11, and 2-stall are 10X11. 13 grass turnouts, fly spray system, GIT manure removal, plenty of security to make your stay clean-- enjoyable--and peaceful. Only a 10 minutes drive to WEF. ''It is magical how peaceful this place is and the owner is meticulous but easy to work with'' --previous seasonal tenant. 18 total stalls please call for what is available.     Horses are happy and safe here!",
      "address": "1363 F Road",
      "latitude": 26.697947,
      "longitude": -80.259144,
      "city": "Loxahatchee Groves",
      "state": "FL"
    },
    {
      "title": "WHITEHALL CONDO AT CAMINO REAL",
      "price": 180,
      "bedrooms": 2,
      "bathrooms": 2,
      "beds": 2,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210210223933650415000000-o.jpg",
      "description": "SPECTACULAR WHITEHALL WITH EXPANSIVE GOLF VIEWS OF THE NEWLY DESIGNED JACK NICKLAUS GOLF COURSE AT THE VIA MIZNER GOLF CLUB. SPA. SPACIOUS, FURNISHED TWO BEDROOM, 2 BATH CONDO IN THE HEART OF BOCA. LAUNDRY ROOM IN THE CONDO! ENJOY 2 COMMUNITY POOLS & CLUBHOUSES. CLOSE TO EVERYTHING BOCA HS TO OFFER: BEACHES, DINING, & SHOPPING. PERFECTLY SITUATED BETWEEN FORT LAUDERDALE AIRPORT & PALM BEACH INT'L AIRPORT",
      "address": "6157 Balboa Circle #103",
      "latitude": 26.345719,
      "longitude": -80.141688,
      "city": "Boca Raton",
      "state": "FL"
    },
    {
      "title": "Hidden Woods Of Deer Cree",
      "price": 200,
      "bedrooms": 2,
      "bathrooms": 2,
      "beds": 2,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210421141230159739000000-o.jpg",
      "description": "Beautiful second floor fully furnished condo with screened balcony off living rm and both guest and master bedroom. Lots of closet space. Full size washer/dryer in the condo.",
      "address": "111 Deer Creek Boulevard #107",
      "latitude": 26.31948,
      "longitude": -80.13782,
      "city": "Deerfield Beach",
      "state": "FL"
    },
    {
      "title": "Atrium",
      "price": 195,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210218214310473231000000-o.jpg",
      "description": "1 BD/BA Studio Available NOW Seasonally or Off-Seasonally. Come enjoy the wide sandy beaches and crystal blue water at the newly renovated Atrium on Palm Beach Shores. Enjoy the 5 star amenities and brand new clubhouse. This rental has all the comforts of a coastal beach getaway. Updated kitchen and bathrooms. This condo is comfortable for 1 or 2 persons and has all the bells and whistles. Balcony views of both Ocean and City. Queen bed in master and washer/dryer in unit. Amenities include new fitness center, community gourmet kitchen, elevator, community rooms, billiard and card room, renovated pool and pool deck and brand new beach walkover.",
      "address": "145 S Ocean Avenue #318",
      "latitude": 26.77968,
      "longitude": -80.032457,
      "city": "Palm Beach Shores",
      "state": "FL"
    },
    {
      "title": "COLONIAL CLUB CONDO SEC 1",
      "price": 185,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210219212237638387000000-o.jpg",
      "description": "Intracoastal community close to beaches, downtown Delray Dining , shopping and Palm Bch airport .  This condo if completely furnished available as early as Oct 2021 for Seasonal rental/This condo will have new flooring installed prior to start of rental.  Must see, close to pool and walkway along the Intracoastal",
      "address": "5 Colonial Club Drive #103",
      "latitude": 26.501225,
      "longitude": -80.05913,
      "city": "Boynton Beach",
      "state": "FL"
    },
    {
      "title": "No 15 Palm-Aire Country C",
      "price": 160,
      "bedrooms": 2,
      "bathrooms": 2,
      "beds": 2,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210421141108966163000000-o.jpg",
      "description": "Updated upper floor 2/2 with pool & Golf views. Wood cabinet kitchen with stainless appliances. Both bedrooms have their own bathrooms. Fully furnished available from 6-12 months. Close to shopping and all major highways.",
      "address": "2600 S Course Drive #603",
      "latitude": 26.220424,
      "longitude": -80.158164,
      "city": "Pompano Beach",
      "state": "FL"
    },
    {
      "title": "OLYMPUS CONDO",
      "price": 175,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210224002642327110000000-o.jpg",
      "description": "PENTHOUSE CONDO WITH DIRECT INTRACOASTAL & WATERVIEWS FROM EVERY ROOM. COMPLETELY RENOVATED. GOURMET OPEN CONCEPT KITHCHEN WITH GRANITE, STAINLESS APPLIANCES, QUALITY CABINETS & GLASS BACKSPLASH. CONTEMPORARY FLOORING THROUGHOUT. BEDROOM HAS 2 LARGE WALK-IN CLOSETS WITH MODERN BATH. COMPLETELY AND TASTEFULLY FURNISHED FOR THE IDEAL SHORT TERM RENTAL. AVAILABLE APRIL 1, 2021. IDEAL LOCATION MINUTES TO BEACHES, AVENTURA MALL, RESTAURANTS & MORE. RENT INCLUDES EXTENDED CABLE, WATER, TRASH, COVERED PARKING. OLYMPUS OFFERS RESORT STYLE LIVING ON 18 GATED ACRES. MULTI MILLION DOLLAR FITNESS CENTER, 2 HEATED POOLS, MARINA AND ROUND THE CLOCK SECURITY.",
      "address": "600 Three Islands Boulevard #1815",
      "latitude": 25.992934,
      "longitude": -80.126048,
      "city": "Hallandale Beach",
      "state": "FL"
    },
    {
      "title": "TCPB CONDO",
      "price": 175,
      "bedrooms": 2,
      "bathrooms": 1,
      "beds": 2,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210301192350168702000000-o.jpg",
      "description": "Great rental community, Fully furnished apartment, everything included, bring your toothbrush",
      "address": "2828 Tennis Club Drive #210",
      "latitude": 26.718609,
      "longitude": -80.116756,
      "city": "West Palm Beach",
      "state": "FL"
    },
    {
      "title": "LEISURE GARDENS CONDO",
      "price": 150,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210422044639378921000000-o.jpg",
      "description": "Available for annual lease as of JULY 2021! This remodeled 1 bedroom and 1.5 baths apartment is located in the well maintained, private community LEISURE GARDENS across the street from the Ocean. Leisure Gardens offers a community pool, shuffleboard, putting green and a BBQ area. This tastefully FURNISHED unit features new floors, a newer kitchen and impact windows and doors. From your living room and glassed patio you are overlooking the pool and garden area. Dock rentals available on request and subject to availability.Laundry facilities on the same floor.",
      "address": "1481 S Ocean Boulevard #211E",
      "latitude": 26.212462,
      "longitude": -80.093722,
      "city": "Lauderdale By The Se",
      "state": "FL"
    },
    {
      "title": "Colony Terrace Apts Co-Op",
      "price": 175,
      "bedrooms": 2,
      "bathrooms": 1,
      "beds": 2,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210305042927443989000000-o.jpg",
      "description": "This a seasonal rental only available May thru October of 2021. This 2 bed and 1 bath corner unit is conveniently located on the first floor in the tranquil neighborhood of Knollridge with an assigned parking space directly in front of unit. Community pool and laundry on site. Unit has been tastefully updated and is fully furnished with all kitchen appliances and utensils needed for a seasonal stay. Located just 1.5 miles from the beach, access to restaurants, shopping centers and grocery stores are just minutes away. 55 + community, at least one must be 55 and the other occupants must be 18 years or older. Seasonal rental for minimum of 3 months and maximum of 6 months. Availability subject to change.",
      "address": "1920 NE 51st Court #101",
      "latitude": 26.19035,
      "longitude": -80.119581,
      "city": "Fort Lauderdale",
      "state": "FL"
    },
    {
      "title": "Ocean Side Villas Apartmen",
      "price": 110,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Villa",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210306022740317145000000-o.jpg",
      "description": "Furnished or unfurnished studios in a great location in East Hollywood, just 1 mile from the beach conveniently located near shopping, just minutes from I 95 and US1. Free WIFI, water is included. Well maintained community with beautiful manicured landscaping. Laundry facilities inside the complex. Fast and easy approval. Plenty of parking spaces.",
      "address": "1600 Taft Street #Studio",
      "latitude": 26.025456,
      "longitude": -80.138907,
      "city": "Hollywood",
      "state": "FL"
    },
    {
      "title": "MIAMI BEACH CLUB A MOTEL",
      "price": 130,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210306022747454178000000-o.jpg",
      "description": "SUNNY ISLES BEST KEPT SECRET! THIS IS A ADORABLE FURNISHED STUDIO, DIRECTLY ON THE BEAUTIFIUL SANDY BEACHES OF SOUTH FLORIDA! STEP OUT OF YOUR STUDIO AND YOUR BACK YARD IS THE OCEAN! NICE POOL AREA AND BARBECQUE AREA! CLOSE TO AVENTURA MALL, FIU, TWO (2) AIRPORTS, I95, HARDROCK HOTEL & CASINO, GULFSTREAM PARK! PRICED FOR A YEARLY RENTAL! WILL RENT FOR A SEASONAL RENTAL AT A HIGHER PRICE! EASY TO SHOW!",
      "address": "19051 Collins Avenue #E209",
      "latitude": 25.952428,
      "longitude": -80.119724,
      "city": "Sunny Isles Beach",
      "state": "FL"
    },
    {
      "title": "GOLDEN LAKES VILLAGE",
      "price": 135,
      "bedrooms": 2,
      "bathrooms": 2,
      "beds": 2,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210308142032569638000000-o.jpg",
      "description": "Experience the Florida lifestyle in this 2B/2B furnished, Light & Cozy condo, recently fresh paint and new laminate flooring, located close to Club House & Facilities. Ideal for relaxing & enjoying the sunset looking at the tranquil water view under the enclosed screened patio. Close to Palm Beach, Shopping, Dr.'s offices, PBI Airport, Turnpike and I95. Golden Lakes is a 55+ adult community that has transportation for your convenience, guard gated and security Heated Pools, Hot Tub, Gym, Business Center, Billiards, Cafe and more. Social activities for every occasion!!",
      "address": "354 Lake Dora Drive #354",
      "latitude": 26.703379,
      "longitude": -80.164091,
      "city": "West Palm Beach",
      "state": "FL"
    },
    {
      "title": "MARINA BAY CLUB",
      "price": 400,
      "bedrooms": 2,
      "bathrooms": 2,
      "beds": 2,
      "placeType": "Apartment",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210311115630489655000000-o.jpg",
      "description": "Phenomenal unit in this condo hotel in Marina Bay Club * only North facing unit with expansive 1000 Sf. private terrace with magnificent and direct views of the intracoastal & ocean.* 2 bedroom + 2 bathroom * Updated unit * Fully furnished and equipped * Stainless Steel appliances in fully upgraded kitchen * Laundry room * Amenities include gym, swimming pool & hot tub overlooking the intracoastal, cabanas * Covered deeded parking * Walking distance to the beach, shopping centers and more! * Available for rent on weekly or monthly basis (prices may vary depending on length of stay) See brokers remarks for showings. Unit is also available for sale A10978280",
      "address": "18100 N Bay Road #1109",
      "latitude": 25.944376,
      "longitude": -80.12456,
      "city": "Sunny Isles Beach",
      "state": "FL"
    },
    {
      "title": "ARLEN BEACH CONDO",
      "price": 200,
      "bedrooms": 1,
      "bathrooms": 2,
      "beds": 1,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210422002621947327000000-o.jpg",
      "description": "AVAILABLE FURNISHED OR UNFURNISHED. SHORT TERM POSSIBLE WITH 4 MONTH MIN.OCEANFRONT BUILDING! BEAUTIFUL RESORT-STYLE CONDO IN THE HEART OF MILLIONAIRE'S ROW, WALK TO RESTAURANTS AND SHOPS, 5 MINUTES FROM SOUTH BEACH. GREAT AMENITIES INCLUDING RESTAURANT/CAFE, HAIR SALON, HEATED POOL, SAUNA, PARTY ROOM, FITNESS CENTER, AND VALET. BASIC CABLE, INTERNET INCLUDED. ON-SITE COVERED PARKING! Call/Text FOR SHOWING INSTRUCTIONS.",
      "address": "5701 Collins Avenue #307",
      "latitude": 25.837944,
      "longitude": -80.120342,
      "city": "Miami Beach",
      "state": "FL"
    },
    {
      "title": "High Point",
      "price": 129.5,
      "bedrooms": 2,
      "bathrooms": 2,
      "beds": 2,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210315180637552320000000-o.jpg",
      "description": "This 2-BR, 2-BA villa with enclosed Lanai and open deck in rear offers tiled living areas, Master Bedroom and carpeted 2nd Bedroom.  Neutral colors and accents.  2nd Bath offers walk-in shower.  Within approximately 4 miles to trendy downtown Delray Beach, open Cafes, Bistro's, white sand beach front and blue-green Atlantic Ocean Shoreline",
      "address": "1080 North Drive #A",
      "latitude": 26.467664,
      "longitude": -80.108537,
      "city": "Delray Beach",
      "state": "FL"
    },
    {
      "title": "SABAL PINE SOUTH CONDO",
      "price": 210,
      "bedrooms": 2,
      "bathrooms": 2,
      "beds": 2,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210324150506443718000000-o.jpg",
      "description": "Fantastic fully furnished 2 bedroom 2 bath first floor condo.. Custom kitchen cabinets, Granite counters, remodeled bathrooms, washer and dryer in unit. Twin beds in guest room, Queen bed in master,  Day bed in living room. Located in the quaint community of Sabal Pines South. East Delray close to shopping, restaurants and beaches",
      "address": "2860 SW 22nd Avenue #4070",
      "latitude": 26.429924,
      "longitude": -80.098156,
      "city": "Delray Beach",
      "state": "FL"
    },
    {
      "title": "ETON HALL CONDO",
      "price": 140,
      "bedrooms": 2,
      "bathrooms": 2,
      "beds": 2,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210427141828680319000000-o.jpg",
      "description": "Nice totally remodeled 2/2 condo, new floors, bathrooms, kitchen lighting, new air conditioning. EASY TO SHOW. Don't miss the opportunity in Lauderhill East a very quiet and well maintained 55+ community, w/ security patrol, 2 clubhouses, 2 heated pools, billards, 2 barbecue pits, recreational activities, library, impeccably landscaped, sauna elevator, washer/dryer on every floor, walking distance to public golf course. Additionally $500 Bonus to Rental Agent.",
      "address": "4341 NW 16th Street #110",
      "latitude": 26.146022,
      "longitude": -80.208102,
      "city": "Lauderhill",
      "state": "FL"
    },
    {
      "title": "Kings Point Burgundy A-Q",
      "price": 172.5,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210323030834425256000000-o.jpg",
      "description": "Right across from the Burgundy pool! Easy access to the courtesy bus stops. Exceptionally spacious & furnished 1/1 condo unit on the second floor with elevator lift and washer & dryer in unit! The bedroom contains 2 beds, fully furnished with everything you will need even cable! Just bring your toothbrush. Available between October 15-March 15 with a 4 month minimum, 6 month max. Inquire for available dates.. HOA takes 30 days",
      "address": "416 Burgundy I #I",
      "latitude": 26.44564,
      "longitude": -80.139255,
      "city": "Delray Beach",
      "state": "FL"
    },
    {
      "title": "ISLANDER CONDO APTS",
      "price": 180,
      "bedrooms": 0,
      "bathrooms": 1,
      "beds": 2,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210323210820908949000000-o.jpg",
      "description": "Available from April 1st. Fully furnished, turnkey Seasonal Rental in the heart of South Beach, one block from the ocean. Gated parking space, internet and cable included. Nice spacious balcony ideal for outdoor dining. Laundry facility in the building, gym, bike room and rooftop swimming pool. Perfect beach living in the heart of South Beach, one block from the ocean. It will not last! The unit no longer has a sofa in the living room, it has a full bed instead. Easy to show. Applicants must show proof of income, credit score & references.",
      "address": "1255 Collins Avenue #508",
      "latitude": 25.783753,
      "longitude": -80.130749,
      "city": "Miami Beach",
      "state": "FL"
    },
    {
      "title": "STERLING VILLAGE",
      "price": 175,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210324161000334668000000-o.jpg",
      "description": "GREAT INTRACOASTAL COMMUNITY, WALK ING DISTANCE TO BEACHES, AND WATERFRONT DINING, GREAT SNOW BIRD NEST, MINUTES TO THE OCEAN",
      "address": "850 Horizons #207",
      "latitude": 26.521061,
      "longitude": -80.055482,
      "city": "Boynton Beach",
      "state": "FL"
    },
    {
      "title": "STRADA 315 CONDO",
      "price": 180,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210422011924676382000000-o.jpg",
      "description": "Strada 315 is an amazing building in Fort Lauderdale, This stunning downtown Furnished One Bedroom is conveniently located minutes from all your shopping, dining and entertainment . You're a step away from vibrant Las Olas Blvd and Beaches. The balcony overlooks the lovely pool. Washer/dryer in the unit. Building has a spectacular fitness center, security guard and business center. Unit has California closets and it is well decorated and with Modern and Contemporary Furniture. Cable and high speed internet are included. Impact windows. Ceramic and laminate flooring. Covered 01 parking space. Two 40-in TVs installed.",
      "address": "315 NE 3rd Avenue #802",
      "latitude": 26.12583,
      "longitude": -80.14102,
      "city": "Fort Lauderdale",
      "state": "FL"
    },
    {
      "title": "HARBOR HOUSE EAST CONDO",
      "price": 170,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210330010559301412000000-o.jpg",
      "description": "Million Dollar View! Enjoy this coastal gem of a one bedroom rental available May through December 2021. Steps from Fort Lauderdale Beach and it's many restaurants and resorts. Located on the widest part of the intercoastal. Enjoy a community dock and ultimate sunsets. Affordable beach life! Sorry...no pets.",
      "address": "9 N Birch Road #105",
      "latitude": 26.123029,
      "longitude": -80.106003,
      "city": "Fort Lauderdale",
      "state": "FL"
    },
    {
      "title": "Century Village",
      "price": 200,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Cabin",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210404235040386154000000-o.jpg",
      "description": "Enjoy the winter months in this spacious 1 bedroom 1.5 bath, 2nd floor garden apartment. Bldg has lift.  Lovely garden views from enclosed patio. Outdoor pool located in  community. Near shopping, entertainment, dining and only 3.5 miles from Beach. Enjoy adult active community with wonderful amenities. indoor Olympic size pool, fitness center, volley ball, tennis, shuffle board, bocce ball, pickle ball, movies, theater, classes, card room, billiards, social activities galore, free transportation and more. Community is 55+.",
      "address": "238 Markham K",
      "latitude": 26.307836,
      "longitude": -80.138718,
      "city": "Deerfield Beach",
      "state": "FL"
    },
    {
      "title": "PORTOFINO CONDO",
      "price": 140,
      "bedrooms": 0,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210407144929415625000000-o.jpg",
      "description": "Only Studio ''pied a terre'' in Portofino!  Totally furnished and updated, travertine throughout, lovely mirrors that brighten the entire unit - impact windows!  Portofino is directly on the Intracoastal with amazing water views, pool - and close to everything in downtown West Palm Beach!",
      "address": "2600 N Flagler Drive #213",
      "latitude": 26.736958,
      "longitude": -80.049858,
      "city": "West Palm Beach",
      "state": "FL"
    },
    {
      "title": "Golden Bay Lodge Co-Op",
      "price": 170,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Apartment",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210411010325346000000000-o.jpg",
      "description": "Beautifully decorated and updated apartment with all new furniture. This is 55 plus community. You walk in the apartment and feel that nobody has lived here after renovations. You feel new, fresh, positive energy. You will enjoy living here across from the ocean. The location is the best to enjoy Florida lifestyle. The electric, cable and internet are included in a rent price. Please call and text listing agent for showing instructions.",
      "address": "2001 S Ocean Drive #16",
      "latitude": 25.978995,
      "longitude": -80.121273,
      "city": "Hallandale Beach",
      "state": "FL"
    },
    {
      "title": "Condo 2 Of Sabal Palm Con",
      "price": 165,
      "bedrooms": 2,
      "bathrooms": 2,
      "beds": 2,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210422073218418864000000-o.jpg",
      "description": "Beautifully Furnished Third floor condo overlooking golf course and water. Two bedroom with option for a third bedroom area or office or family room. 'ONLY' Available June 1st 2021 thru December 15th 2021. You are automatically a member of Pine Island Ridge Country Club and all the amenities that comes with it. Four swimming pools, golf, Tennis, Gym, Sauna, Steam room, Basketball, two Restaurants and Lounges, 19th hole, Barbeque area, Kids park. Never leave your community two Shopping Centers with everything at the end of the street, Publix, Movie Theater, Two Pizza Places, Sushi, Barbeque, Seafood, Subway, Country Western Dancing, Dunking Donuts, Beal's, Automotive Shop, Goodwill, UPS Store, Barber and Beauty Shops, Manicure's, & more Shopping. 'THE BEST KEPT SECRET IN BROWARD COUNTY'",
      "address": "1831 Sabal Palm Drive #303",
      "latitude": 26.095551,
      "longitude": -80.275594,
      "city": "Davie",
      "state": "FL"
    },
    {
      "title": "THE CARRIAGE HOUSE CONDO",
      "price": 200,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210422030424488302000000-o.jpg",
      "description": "Spectacular Intracoastal - City & Bay view from this studio converted to 1 bedroom, 1 bath, open kitchen, ceramic floors, walk-in closets, large balcony, great condition! Full service oceanfront building, 24hrs security, gym, pool, jacuzzi, tennis court, restaurant, mini- market and more! ** Unit can be rent for six months only **",
      "address": "5401 Collins Avenue #729",
      "latitude": 25.832692,
      "longitude": -80.120587,
      "city": "Miami Beach",
      "state": "FL"
    },
    {
      "title": "Water Tower Commons",
      "price": 193.9,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Apartment",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210414151513366766000000-o.jpg",
      "description": "Penthouse level 1 bedroom, 1 bathroom Rental without long term commitment. This place is like being at a Resort Paradise. Brand new Everything. Palatial Beach entry Swimming Pool, covered cabana's, Outdoor kitchen and bar, Billiards and ping pong, State of the Art Fitness center, steam room and sauna, Massage rooms, on site theater/screening room, Monthly resident parties. A wonderful place to get started in South Florida. So Easy!    Granite countertops in the kitchen and Bathroom, White shaker style cabinets, New appliances, Impact windows and doors, High ceilings throughout, Brand new A/C and water Heater, Washer and dryer in unit, 24 hour gated security, Pet friendly.  Minutes from the Beach or I-95.    See walk thru video at  https://fb.watch/4VoYmbpOYy",
      "address": "1020 Water Tower Way #306",
      "latitude": 26.589017,
      "longitude": -80.062717,
      "city": "Lantana",
      "state": "FL"
    },
    {
      "title": "Boca Towne Centre Condo A",
      "price": 160,
      "bedrooms": 2,
      "bathrooms": 2,
      "beds": 2,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210421153219397418000000-o.jpg",
      "description": "Totally remodeled apartment , ready to move in, walking distance to beach, restaurants and supermarket, Boca raton Elementary school. New A/c, brand new stainless steel new appliances, all new tile flooring, two full bathrooms. First , last and security require to move in. Application for Association its attached under forms. The landlord already paid the $1000 tenant association deposit .",
      "address": "550 SW 2nd Avenue #126",
      "latitude": 26.344993,
      "longitude": -80.089337,
      "city": "Boca Raton",
      "state": "FL"
    },
    {
      "title": "Beacon House Condo",
      "price": 170,
      "bedrooms": 2,
      "bathrooms": 1,
      "beds": 2,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210421164012191975000000-o.jpg",
      "description": "ALL AGES--BEAUTIFUL 2ND FLOOR CONDO W/POOL VIEW, SCREENED PATIO. FURNISHED IN A VERY TASTEFUL MANNER, 2 BEDROOMS 1 BATHROOM, WASHER/DRYER IN YOUR UNIT, OFFERS SPACIOUS LIVING IN STYLISH COMFORT. STONE LOOK TILE FLOORS, SOFT COLORS W/COMFORTABLE FURNISHINGS. MASTER BEDROOM HAS PATIO DOOR ACCESS. CENTRALLY LOCATED IN THE LHP MARINA AREA, JUST FEW MINUTES TO THE INTRA-COASTAL,GREAT RESTAURANTS. RENTS FURNISHED-FOR ALL AGES BUT ABSOLUTELY NO PETS - SORRY): (First & Security with good credit)",
      "address": "2748 NE 28th Avenue #19",
      "latitude": 26.265298,
      "longitude": -80.084563,
      "city": "Lighthouse Point",
      "state": "FL"
    },
    {
      "title": "KINGSWOOD II CONDOS",
      "price": 150,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210417212206435016000000-o.jpg",
      "description": "Looking for a tropical getaway? This one bedroom, one bath, first floor condo is waiting for you. Turnkey furnished, includes basic cable, WiFi, electric and water, amenities galore in this 24/7 manned gated community. Indoor and outdoor pools, fitness center, main clubhouse, tennis, courtesy bus and more! Nice private location. Close to downtown West Palm Beach, shopping, dining, and beaches. No smoking and No Pets allowed.",
      "address": "65 Kingswood D #65",
      "latitude": 26.710787,
      "longitude": -80.124865,
      "city": "West Palm Beach",
      "state": "FL"
    },
    {
      "title": "TROWBRIDGE CONDO",
      "price": 200,
      "bedrooms": 2,
      "bathrooms": 2,
      "beds": 2,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210419230406392728000000-o.jpg",
      "description": "SEASONAL 4 PLUS MONTHS GARDEN VIEW WITHIN 2 FEET OF THE ELEVATOR. FULLY FURNISHED 2 BEDROOM APARTMENT .2nd Bedroom has Sleeper Sofa,   EQUIPED WITH CABLE AND INTERNET INCLUDED.  TENANT PAYS ELECTRIC AND WATER. LARGE LAUNDRY ROOM WITH FULL SIZE WASHER AND DRYER.    **NO SHOWINGS TILL MAY 1ST SORRY CURRENTLY RENTED **",
      "address": "15342 Lakes Of Delray Boulevard #107",
      "latitude": 26.450553,
      "longitude": -80.131778,
      "city": "Delray Beach",
      "state": "FL"
    },
    {
      "title": "Galt Towers Condo",
      "price": 185,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210421155137978405000000-o.jpg",
      "description": "Spacious and bright 1 BR/1.5 BA with large balcony condo on the ocean available for a seasonal rental now thru Dec 30th, 2021. Enjoy beachfront property with direct access to beach. Many building amenities heated pool, state of the art gym, 2 BBQ's, library, social room, wifi and more. Unit features King bed with ensuite, walk in closets, utilities included (water, electric, cable). Walking distance to Lauderdale by the Sea Pier, restaurants and shops. Supermarket, Shopping, CVS, restaurants conveniently located on Galt Ocean Mile. Unit available for a minimum of 3 months. Renter's insurance is required by the tenant per the association.",
      "address": "4250 Galt Ocean Drive #3c",
      "latitude": 26.180011,
      "longitude": -80.096898,
      "city": "Fort Lauderdale",
      "state": "FL"
    },
    {
      "title": "HOLLYWOOD CENTRAL REACH",
      "price": 200,
      "bedrooms": 1,
      "bathrooms": 2,
      "beds": 1,
      "placeType": "Apartment",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210422045954576619000000-o.jpg",
      "description": "Furnished Bungalow on the Ocean! Literally few steps to the beach. ! Bedroom 2 Bathrooms with King Size, Living area and kitchen fully equipped. Total Beach lifestyle cozy and private. 1 Parking space assigned. Walk to Tiki Bar, State Parks and fish on the bay or the Ocean. Price includes water and electricity. Small Pets subject to owner approval.",
      "address": "315 Walnut Street #7",
      "latitude": 26.051,
      "longitude": -80.11276,
      "city": "Hollywood",
      "state": "FL"
    },
    {
      "title": "CASTLE BEACH CLUB CONDO",
      "price": 255,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210422163904486851000000-o.jpg",
      "description": "BEAUTIFUL RENOVATED ONE BEDROOM ONE FULL BATHROOM AT THE CASTLE BEACH HOTEL IN THE HEART OF MIAMI BEACH. UNIT IS FULLY EQUIPPED.ONE PARKING INCLUDED. $150 FINAL CLEANING FEE . ENJOY A RESORT STYLE LIVING RIGHT ON THE OCEAN.AVAILABLE STARTING JUNE 6TH,2021.Equal Housing Opportunity.",
      "address": "5445 Collins Avenue #403",
      "latitude": 25.834088,
      "longitude": -80.120232,
      "city": "Miami Beach",
      "state": "FL"
    },
    {
      "title": "Voyager Condo",
      "price": 159.5,
      "bedrooms": 2,
      "bathrooms": 2,
      "beds": 2,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210424121441404890000000-o.jpg",
      "description": "This lease is a 4 MONTH LEASE ONLY - beginning July 1, 2021 and ending October 31, 2021. Spacious Southeast facing 2/2 with awesome Intracoastal views from open balcony. Enjoy summertime just a block from the beach. Just a block over Intracoastal bridge to beachfront tiki bar and restaurants. Only 1 mile to one of South Florida's best beachfront fun spots at the end of Atlantic Blvd. in Pompano Beach. Awesome boardwalk with new restaurants, bars, kiddie playground and so much more. Condo has in-unit full size washer/dryer, and tons of guest parking. Oversized resort style heated pool at waters edge and state of the art bbq area with bar. Million dollar lifestyle for a whole lot less!",
      "address": "2900 NE 14th Street #510",
      "latitude": 26.249735,
      "longitude": -80.091478,
      "city": "Pompano Beach",
      "state": "FL"
    },
    {
      "title": "CITYPLACE SOUTH TOWER CONDO",
      "price": 185,
      "bedrooms": 1,
      "bathrooms": 1,
      "beds": 1,
      "placeType": "Condo",
      "spotPhotos": "http://cdn.photos.sparkplatform.com/fl/20210427141416763335000000-o.jpg",
      "description": "Water, basic cable, Internet and trash removal included in rent. Gorgeous 1 bedroom, 1 bathroom on the 17th floor of City Place South Tower with amazing city and Clear Lake views. Building amenities include fully equipped spa and fitness center with sauna, 9th floor club deck with a resort-style pool, grill, outdoor party room, Wi-Fi access throughout, party lounge including billiard area, catering kitchen, video gaming center, and large flat screen TV's. The building is located in the center of a vibrant community known for its local art scene, world-class performing arts, internationally renowned restaurants and shops, and pristine waterways.",
      "address": "550 Okeechobee Boulevard #1721",
      "latitude": 26.705047,
      "longitude": -80.056274,
      "city": "West Palm Beach",
      "state": "FL"
    }
]